mathis-lambert/Temperature_Pressure_Humidity-STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32l475e_iot01.h"
#include "stm32l475e_iot01_tsensor.h"
#include "stm32l475e_iot01_hsensor.h"
#include "stm32l475e_iot01_psensor.h"
#include "wifi.h"
#include <math.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define WIFI_SSID "Livebox-22D0_5GHz"
#define WIFI_PASSWD "qrvN2TXtx4S2kvFVHD"
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

QSPI_HandleTypeDef hqspi;

SPI_HandleTypeDef hspi1;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */
uint8_t MAC_Addr[6];
uint8_t IP_Addr[4];
float temp_value = 0;
float h_value = 0;
float p_value = 0;      // Measured temperature value
char str_tmp[100] = ""; // Formatted message to display the temperature value
char str_macaddr[100] = "";
char str_ip[100] = "";
uint8_t msg1[] = "=====> All sensors are initialized \r\n ";
uint8_t msg2[] = "****** WELCOME TO Mathis's room IoT service v1.0.0 ******\n\n\r";
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_SPI1_Init(void);
static void MX_UART4_Init(void);
void transmit_string(char *StrArg)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)StrArg, strlen(StrArg), 10);
}
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DFSDM1_Init();
  MX_QUADSPI_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_SPI1_Init();
  MX_UART4_Init();
  /* USER CODE BEGIN 2 */

  BSP_TSENSOR_Init();
  BSP_HSENSOR_Init();
  BSP_PSENSOR_Init();
  HAL_UART_Transmit(&huart1, msg1, sizeof(msg1), 10);
  HAL_UART_Transmit(&huart1, msg2, sizeof(msg2), 10);

  while (1)
  {
    if (WIFI_Init() == WIFI_STATUS_OK)
    {
      /*transmit_string("> Module Initialized \n");*/
      /*if (WIFI_GetMAC_Address(MAC_Addr) == WIFI_STATUS_OK)
      {
        snprintf(str_macaddr, 75, "> es-wifi module MAC Address : %X:%X:%X:%X:%X:%X\n",
                 MAC_Addr[0],
                 MAC_Addr[1],
                 MAC_Addr[2],
                 MAC_Addr[3],
                 MAC_Addr[4],
                 MAC_Addr[5]);
        HAL_UART_Transmit(&huart1, (uint8_t *)str_macaddr, sizeof(str_macaddr), 100);
      }
      else
      {
        transmit_string("> ERROR : CANNOT get MAC address\n");
        continue;
      }*/

      if (WIFI_Connect(WIFI_SSID, WIFI_PASSWD, 0x03) == WIFI_STATUS_OK)
      {
        /*transmit_string("Module connecte !! \n\n\r");*/

        if (WIFI_GetIP_Address(IP_Addr) == WIFI_STATUS_OK)
        {
          snprintf(str_ip, 100, "> Le module WIFI a l'adresse IP : %d.%d.%d.%d\n\n\r", IP_Addr[0], IP_Addr[1], IP_Addr[2], IP_Addr[3]);
          HAL_UART_Transmit(&huart1, (uint8_t *)str_ip, sizeof(str_ip), 100);

          uint32_t socket = 0;
          const char *name = "api.mathislambert.fr";
          uint8_t ipaddr[] = {179, 61, 246, 134};
          uint16_t port = 80;
          uint16_t local_port = 61534;
          while (1)
          {
            if (WIFI_OpenClientConnection(socket, WIFI_TCP_PROTOCOL, name, ipaddr, port, local_port) == WIFI_STATUS_OK)
            {

              /*transmit_string("> Connected to the server ! \n\r");*/

              temp_value = BSP_TSENSOR_ReadTemp();
              h_value = BSP_HSENSOR_ReadHumidity();
              p_value = BSP_PSENSOR_ReadPressure();
              int tmpInt1 = temp_value;
              int humInt1 = h_value;
              int presInt1 = p_value;
              float tmpFrac = temp_value - tmpInt1;
              float humFrac = h_value - humInt1;
              float presFrac = p_value - presInt1;
              int tmpInt2 = trunc(tmpFrac * 100);
              int humInt2 = trunc(humFrac * 100);
              int presInt2 = trunc(presFrac * 100);

              char json_data[150];
              snprintf(json_data, 150, "{\"values\": {\"temp\": %d.%02d, \"hum\": %d.%02d, \"pressure\": %d.%02d}}", tmpInt1, tmpInt2, humInt1, humInt2, presInt1, presInt2);

